name = input("Введите имя: ")
surname = input("Введите фамилию: ")
year_of_birth = input("Введите год рождения: ")

# ИСПРАВИТЬ: вывод не соответствует требуемому формату (отсутствует запятая)
# ИСПРАВИТЬ: возраст — это число лет, а не год рождения
print(surname, name, year_of_birth)


# КОММЕНТАРИЙ: во всех задачах, связанных с генерацией строк по некоему требованию, вам необходимо сравнивать получившуюся строку с приведённой в примере
# Бондаренко Николай 2004
# КОММЕНТАРИЙ: генерация строк встречается очень часто не только в учебных задачах, но и во вполне прикладной разработке — строки определённого формата требуют на вход различные функции, API сервисы, другие приложения и т.п.


# ИТОГ: доработать — 1/3
